# Brewfile for harmon-init (template maintenance tooling)
# Install with: task install  (brew bundle --file=Brewfile)

# Template engine
brew "copier"

# Task runner + git hooks
brew "go-task"
brew "lefthook"

# Git / GitHub
brew "git"
brew "gh"

# Lint / format
brew "shellcheck"
brew "shfmt"
brew "actionlint"
brew "yamllint"

# Security
brew "gitleaks"
tap "snyk/tap"
brew "snyk/tap/snyk"

# Runtime for npx-based tools (commitlint, markdownlint-cli2)
brew "node"

# Utilities
brew "jq"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "bat"
brew "act"

# macOS apps
cask "visual-studio-code"
cask "bunch"
